<a href="https://colab.research.google.com/github/saipavansiddarth/pandas_exercises/blob/master/05_Merge/Housing%20Market/Exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [0]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
s1 = pd.Series(np.random.randint(1,high=5,size=100,dtype='l'))
s2 = pd.Series(np.random.randint(1,high=4,size=100,dtype='l'))
s3 = pd.Series(np.random.randint(10000,high=30001,size=100,dtype='l'))
print(s1,s2,s3)

0     3
1     2
2     1
3     2
4     2
     ..
95    4
96    4
97    2
98    2
99    2
Length: 100, dtype: int64 0     2
1     2
2     3
3     3
4     2
     ..
95    2
96    1
97    1
98    2
99    1
Length: 100, dtype: int64 0     24133
1     20455
2     12324
3     18311
4     20371
      ...
95    21774
96    24365
97    15515
98    16742
99    21980
Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [4]:
housemkt = pd.concat([s1,s2,s3], axis=1)
housemkt.head()

   0  1      2
0  3  2  24133
1  2  2  20455
2  1  3  12324
3  2  3  18311
4  2  2  20371

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [5]:
housemkt.rename(columns={0:'bedrs',1:'bathrs',2:'price_sqr_meter'}, inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      3       2            24133
1      2       2            20455
2      1       3            12324
3      2       3            18311
4      2       2            20371

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [10]:
# join concat the values
bigcolumn = pd.concat([s1, s2, s3], axis=0)

# it is still a Series, so we need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       3
1       2
2       1
3       2
4       2
..    ...
95  21774
96  24365
97  15515
98  16742
99  21980

[300 rows x 1 columns]

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [11]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [13]:
bigcolumn.reset_index(drop=True,inplace=True)
bigcolumn

         0
0        3
1        2
2        1
3        2
4        2
..     ...
295  21774
296  24365
297  15515
298  16742
299  21980

[300 rows x 1 columns]